info/TODO.org
#+DATE: Time-stamp: <2020-04-06>
#+bind: org-html-preamble-format (("en" "%d"))
#+OPTIONS: html-link-use-abs-url:nil html-postamble:t html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:t
#+OPTIONS: stat:t tags:t tasks:t tex:t timestamp:t toc:1 todo:t |:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+HTML_LINK_HOME: https://github.com/dieter-wilhelm/apdl-mode
#+HTML_LINK_UP: index.html
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+LATEX_HEADER:
#+STARTUP: showall

# #+title: The TODO file of APDL-Mode

* TODO Version 20.5.0
** Todos, bugs
*** State of documentation
    - intro presentation
    - work on the Info index
    - image directory in .info file is not existing in Melpa! Do we
      need images in the manual? No
    - #+include: #+title adds to info title!
    - Attention ":" in headline gives a texinfo reference!
    - C-u info file
    - package with file "dir"
    - only up to 3 *** levels! configurable?
    - info doesn't know about clickable function links
    - info doesn't have links, yet
      - (describe-package 'helpful)
	[1]  https://github.com/wilfred/helpful
	> Similarly, help-fns+.el.
	> There you have option `help-cross-reference-manuals':
    - customise system (explain `M-x customize-set-value' as long as
      (debbugs-gnu-bugs 25678) is not solved)
    - license status buffers in docu
    - add intro help to the wb-template system
    - explain interactive browsing of keywords => menu entry

    - Presentations
      - Präsentation Intro, tutorial
      - in-dept presentation
      - APDL reference => just Info?
** minor bugs
   - C-u C-c C-b in browser on Win10 for "All"stuff isn't skipping to
     the respective section on page for Chrome and Edge!?
   - 1/en, en is variable but fraction not fontified?
** check
   - EWW bug: not working with remote ssh -help-path
     (debbugs-gnu-bugs 40425)
   - changed file size without warning to 30 MB what is Emacs-26
     using?
** wishes
*** templates
    - Add more WorkBench/ Discovery AIM templates
    - Intelligent template selector with keywords in the line of helm
      or ivy?
    - What is the advantage of ARG1-9? => parameter system, should I
      include ARG[1-9] optionally?
*** misc
    1) functions - like NDNEXT - is completed but not possible to
       search in C-c C-b or M-? => function template or special
       section?
       - post26
    2) More subjects in -browse-apdl-help for example /post26, etc.
    3) The Command (APDL) objects coding system seems to be
       mule-utf-8-dos aka cp65001-dos, document this
    4) derive A-M from prog-modes => branch derived
    5) Travis CI continuous integration!
    6) https://github.com/marketplace/coveralls
    7) Start optionally runbWB2 --aim, Discovery AIM
    8) Melpa README, better wait till emacs-27

** Done
** Push and Release Proceedures
   - make PACK now obligatory for any push!

   - NEWS.org
   - README.org News
   - TODO.org
   - make PACK!

   gca = git commit -a = gau + gc
   gta = git tag -a 20.6.0
   g push --tags

   Ansys updates:
   Attention: in apdl_keywords.txt there are many
   trailing whitespaces (delete-trailing-whitespace)

   whitespace-mode
   package-lint
   checkdoc, flycheck etc. : from makefile?

    # for makefile
    APDL_MAJOR := 20
    APDL_MINOR := 6
    APDL_PATCH := 0
    # A-M version
    (tags-query-replace "20\.5\.0" "20.6.0")
    # copyright year
    (tags-query-replace "- 2020" "- 2021")
    # ansys version
    (tags-query-replace "v201" "v211")
    # emacs
    (tags-query-replace "26\.3" "27.1")
    (tags-search "((emacs \"25.1\"))")

* DONE Version 20.4.0
  [2020-04-01 Mi]
  updated to 2020R1
* DONE Version 20.3.0
  [2020-03-24 Di]
  Melpa
  feature freeze [2020-03-20 Fr]
#  Ansys local help v201 1.7 GB [2020-03-17 Di]
* DONE Version 20.2.0
  [2020-03-10 Tue]
* DONE Version 20.1.1
   - are the material properties documented, matlib?  Matlib is used
     in -template.el, how about document this directory somewhere?
     Done in matlib/README.org
  - document the APDL Parameter Help Duration in M-?: Done in
    -config.org!
  - bug-report about package.el "NAME-readme.txt", done
* Version 162-2:
** Bugs
   - C-c C-s first time visit: User variables file-name-extension:
     Wrong type argument: stringp, nilError during redisplay:
     (jit-lock-function 1) signaled (wrong-type-argument stringp nil)
   - /sho is not not font-locked
   - c*** without argument is not font-locked
   - jit-lock-function errors
   - RESCOMBINE is not fontified
   - M-? on an empty buffer returns *abbr* help instead of a warning
   - C-c C-j tries to send a next line in the LAST line and after an
     /exit command
   - -send-to-ansys, -send-above copy empty regions or only comments
   - importing template-header into empty file doesn't change file
     status to changed!
   - error for -skeleton-outline-template when called ansys-mode
     for an unnamed file without extension.
   - APDL + WB -> Window Name is ... - Mechanical APDL (Ansys
     Structural)
** Freeze
   - Documentation of installation, usage and configuration!
     + C-c C-{w,y,x}
     + sending to classics
   - Menu for checking availablity for the X11 helper functions
   - List of all new functions <- bug-report.sh
