info/TODO.org
** Wish-list
   - C-c C-v show only the latest most current variable, if in a
     variable block
   - remove spurious defcustoms which are calculated, or leave them as
     last resort?
   - a-start-wb: start-process seemingly uses the current working
     directory, there might be a problem, when "pwd" of the current
     buffer was/is an unavailable network drive .
   - add bbdb files to emacs packages
   - -help-program-parameters obsolete
   - option to make eww default help browser
   - MinGWin: FindWindowFindWindow(CLASSNAME, WINDOWNAME)
     + ActivateWin: SetFocus()  + SendKeys? SendKeys
     https://www.transmissionzero.co.uk/computing/win32-apps-with-mingw/
     https://msdn.microsoft.com/en-us/library/aa383749.aspx
   # - switch off advising of M-w, yeah, yeah
   - C-c C-a does not take signs (e.g. +13.0, -8.3) befor numbers into account
   - Targeting Ansys Aim
   - customisation :version attribute is not clear and not defined for
     new stuff
   - Mouse completion is working with *middle* mouse button (mouse-2) but only
     on the second LMB or, in the case of C-c C-s, not at all.
   - *mwrite
     *cfclos
     M-? shows help for *mwrite, when cursor behind *cfclos and in the
     last line without \n
   - Make a usage.org, splice into a-mode.el
   - -wb function (doesn't adjust along the decimal point)? -> align-rules-list
   - Changing license type on the fly (with C-u) for -display-license-status
   - tool tip help-echo properties for keywords!
   - permanent saving option for -license-file, -lmutil, -program, ...?
   - Check for valid license types for the solver
   - license and template status line always in the first visible line
     of buffer (in-place-annotations?)
   - splash screen?
   - -license-status optional filters for output
   - C-c C-c checking blocks
   - include ../ansys/apdl macros?
   - ../apdl/start162.ans valuable?
   - add screw thread capability to WB translation
   - color scheme of *msg command is only readable on terminals
   - abreviated input method for all graphics functions zoom, etc.
   - defaults for template MP
   - add adwords to gh-pages
   - -show-command-parameters is not dynamically updated in the first line
   - Correct the creep data together with young's modulus and total
     strain to creep strain!
   - variables behind / and * without whitespace in between are not
     highlighted! try changing the character syntax???
   - implement -hide-region also for rotated nodes in WB .dat files
     (frictionless support)
   - started and commented out highlighting of solver output
   - Variables are not highlighted in -skeletons, it is specified in
     -mode only for files with .mac suffix; *create file tmp,mac:
     macro call: tmp, is not highlighted
   - ansys-template.el:85:13:Warning: reference to free variable
     `ansys-skeleton-overlay'
   - mouse-choose-completion is obsolete since E23.2
   - add timer customisation for -command-parameter-help variable 1
     min, 2 min, etc.
   - check *vwrite with gui mode and interactive mode (graphics window?)
   - add element numbers to the general completion list, yes or no?
   - WikEmacs, Melpa, GNU ELPA and/or marmalade, Ansys-Mode debian
     .deb package
   - HTML APDL documentation
     here is the tanslation of names to html files:
     - link to Ansys-Mode APDL reference:
     - Chapters of structural APDL documentation:
   - TODOS: in fontification.org
     - deletion of vectors *del,Vector without request? ,,nopr?
     - check character variables 32 Chars. and highlight accordingly
       string 128, char 8
     - *vscfun: mean, stdev, ...
   - _RETURN (-mode) somewhat milder red, clashes with reseved vars!
   - test server specifications (menu!) make interconnect
     conditional of the Ansys version >= 120
   - explain fill/*vfill under the "looping" commands: Generates a line
       of nodes between two existing nodes.
   - switch automatically to read only mode for *.dat files?
   - force harmonic table (*vfill) example in -skeleton-bc, make a
       ansys...-template out of two-mass-harmonics.mac
   - -program, -license-file and -ansysli-servers should show the
     current selections
   - check -license-file var with -license-file-check
     - Emacs var  :DONE:
     - env vars  :DONE:
     - activate -license-file function :TODO:
   - document Lagrange contact behaviour for contact/press-fit
     skeleton, critical to element differences!
   - -dynamic-highlighting is sluggish, highlighting somehow
     retarded!!! Still??
   - constraint equations in -ansys-template.el and get functions
   - enable hiding of geometry items in .anf files
   - fontification.el
     - add the 4 Ansys neutral file (aux15) functions to the parameter-help,
       .anf files from DM anf export
         kpt -- Write keypoints or vertices into the database
         lcurv -- Write lines or edges into the database
         asurf -- Write the area or face information into the database
         vbody -- Define a B-rep solid.
     - add Hlp_G_OPE6_NeutralFile.html (aux15 utility functions)
       commands to the fontification and help stuff: KPT, LCURV,
       ASURF, VBODY. (functions in ANF files) from the operations
       guide `ans_ope.pdf'
     - some functions in -skeleton-function are not highlighted and
       completable, whitespace problem befor paren...
       and: "nele" undocumented command and function nelem()
   - inconsistencies in A-M_introductory_tutorial.org
     - the parameter help overlay is dated
     - in variable.png symbols Ns and Ls are not highlighted as
       variables
     - change sequence of alignment.png first not aligned, second aligned
     - Too difficult: slide of extensibility, showing Emacs
       self-documenting help system for a template function
** Deficiencies:
   - Highlighting :: Experimental user variable highlighting
		     does not take into account:
     + clearing of variables and
     + usage of variables before their definitions (uninitialised
       variables)
     + the variable fontification might clash with Ansys specifiers
     + string substitution of %variables% in strings does not highlight
	them in the proper variable face
   - Highlighting :: A label :LABEL may appear behind the /input
                     command and is not highlighted as label
   - Highlighting :: An apostrophy clashes with the Ansys "char"
                     specifier Keybinding: M-Tab is captured under
                     Windows and some GNU-Linux desktops Workaround: Press
                     instead of M-Tab (ALT + TAB) the ESC key and then
                     the Tab key (ESC, TAB) or apply the command from
                     the menu bar
   - Keybinding :: M-j: When there is already a `&' in a format command
                   (like *msg, *vwrite, *mwrite)
                   ansys-indent-format-line inserts a redundant one
   - Keybinding :: C-c C-j jjj not working with Emacs version < Emacs-24
   - Completion :: Of parametric function parentheses
		   completes redundant closing parentheses
   - Completion :: A mouse selection from the *Ansys-completion* buffer
                   is only inserted upcased.
   - Completion :: Ansys command 'C***' will not be completed
   - Skeleton :: Mouse selection of -structural-template does not work
                 (because of stipulated user text input from this skeleton)
   - Navigation ::  C-c { does not skip an overlay in a number-block
                   (M-{ does it though))

** Procedures
   - GNU-Linux :: instead of GNU/Linux as FSF suggesting ;-)
   - Mode Help :: keyboard input is quoted in "", emphasizing in `' and
                  keys in <>
   - APDL templates :: minimal working examples ending with -template
   - Menu :: -> indicates the following sub menu entry ->
   - M-x compile :: ALL ;-)

    GH-wiki is repo with write access for world, separate from the A-M repo!

