info/TODO.org
** Freeze proceedures
  - check whether all undocumented commands
    [[elisp:(find-tag "Ansys_undocumented_commands")]]
    are still working in V 162
  - (tags-search "-TODO-")
  - (tags-search "-FIXME-")
  - checkdoc, -ansys-template.el, -ansys-process.el, -mode.el done except
    \\<keymap> & \\[function]
  - README -- installation (Emacs Wiki format) and accompanying files,
       features, news, history
  - update the mode help, update version numbers, default specifiers
  - update defcustom list in ./bug-report.sh -> ansys-submit-bug-report
  - update/complete skeletons menu

    # ansys
    (tags-query-replace "161-2" "162-1")
    # this is for Conti stuff
    (tags-query-replace "16.2.0" "17.1.0")
    (tags-query-replace "16.1.0" "16.2.0")
    (tags-query-replace "Ansys 16" "Ansys 17")
    # emacs
    (tags-query-replace "24\.5" "25.1")
    # version No
    (tags-query-replace "161" "162")
    # for _mode_version
    (tags-query-replace "20\.1\.0" "20.1.1")
    (tags-query-replace "\"1.1\"" "\"1.2\"")
    # copyright
    (tags-query-replace "- 2020" "- 2021")
    # (tags-query-replace "fontification.mac" "example.mac")

    checkdoc then dry run: Emacs
    24.5 -Q testing: example.mac /*commands and default command
    lines, every menu entry.  byte-compile-file then dry run
    profiling, major mode conventions: multiple loading of this mode?.
  - check Emacs versions on longterm OS systems compile with 24.X,
    then pretests, emacs-snapshots, clash with Emacs releases (yearly
    Emacs cycle)?

** Release
  - Add the latest news from NEWS.org to the README.org
  - update Emacs wiki (README), home page, GitHub
  - publication emails (with tutorial and news):

    The project is hosted on

    [[https://github.com/dieter-wilhelm/apdl-mode]]

    Where you will find the latest development version.

    Stable versions and prebuild packages are on the releases page:

    [[https://github.com/dieter-wilhelm/apdl-mode/releases]]

      Dieter

** Ideas for further versions
*** Parameter help and documentation
    - Enable a mouse button to unhide hidden regions, enable an
      interactive way to unhide regions, when in the region: Return
      opens hidden region, ...
    - dynamic completion and help of parameter options, depending on
      the contex like the one in bash
    - makeinfo documentation with org-mode ox exporter
    - make completion of templates with <mouse 1> button additionally
      to <mouse 2> as in -complete-symbol.
    - create a function showing deprecated elements and their
      replacement.  Inspirations from eldoc-mode, show replacements of
      deprecated elements?
    - create a reference card
    - show list of license products and their license feature names or
      translate it in the license status from the licensing guide
      (product variable table)
    - C-c C-v show (optionally) only variables defined up to current
      cursor line.  Make the line number display in
      `ansys-display-variables' (hyper-)links to the corresponding code
      line in the respective APDL file.  (See `occur' function.)  Or
      use the imenu mechanism for this and display the variables in the
      speedbar. Count the number of user variables when displaying them
    - refcard, etc; Emacs help guidelines
      GNU programming guideline: More requires?,
    - display alternatives to/swap deprecated element types
    - M-? Help: parametric functions are not explained with the help
      command
    - M-? Help: if there are ignored characters behind the keyword, the
      keyword is not found
    - M-? the command help does not work when there are solver ignored
      characters behind the unique command name, example: *VWROOOOM.
    - M-?: following a variable allocation with `='
    - M-?: In the last empty line displays overlay below command
      instead above
    - Provide Ansys command completion and command-help in comint
      buffer
    - Include all inquiry functions (see UPF documentation)
    - Include the _RETURN value of the solid modelling commands into
      their help strings of parameter help.
*** Ansys process and interpreter buffer
    example: gnuplot-mode
    - call to start the Ansys solution results tracker for .nlh (xml
      see file:file.nlh, contact forces) and convergence .gst (binary?,
      coded? file:file.gst)
    - implement something like [[file:nlhist.sh]] for .cnd files (xml see
      file:file.cnd) or use the new libxml parser ;-)
    - make display-buffer "*Ansys*" optional when sending commands to
      the Ansys process
    - use Ansys *env variables* like AWP_ROOT140 for checking
      installation directories
    - check also the license status for hpc licenses if
      -no-of-processors is greater then 3
    - implement ANSWAIT variable
    - autoloading of: -license-file, -license-program functions
    - dbus support of workbench or integrating emacs in workbench?
    - insert skeleton with C-c C-s i, send line C-c C-c ccc
    - warn when C-c C-c tries to send a block command (complete to full
      block?)
    - take care when region isn't complete in -send-to-ansys (send whole line)
    - C-c C-c skips empty lines and comments this is not always desirable
      -> make this optional -> filter process input?
    - C-c C-q, C-c C-u and C-c C-c sequences are not shown (and stored)
      in the comint buffer
    - make filter of -license-status optional
    - optimise -start-run with query of y (start immediately),n
      (exit),e (change params),C-h (help)
    - Splice any input line behind the BEGIN: symbol in the *Ansys*
      buffer
    - Enable one solver run for every Ansys macro buffer
    - indicate with activation/inactivation of menu items that an
      asynchronous job is already running or not.
    - show/mark sent lines in apdl file C-c C-u, C-c C-c,
      + with fringes
      + with background
      + maximum line
      + reset highlighting, when?
    - provide Ansys `y' request and carriage return? superflouous?  a
      single `y' does the trick
    - Killing a buffer with a running process now asks a confirmation.
      You can remove this query in two ways: either removing
      `process-kill-buffer-query-function' from
      `kill-buffer-query-functions' or setting the appropriate process
      flag with `set-process-query-on-exit-flag'.
     - finding an Ansys /filnam command in current macro file and
       suggesting this as current job-name optionally kill old job when
       called again with working run warn and optionally remove the
       ansys lock file before starting a run
     - search in -job for /filn arguments as default job name like in
       -display-error-file
