info/TODO.md


<a id="org443c8f2"></a>

## Skeletons, outline and abbrevs

-   show a preview buffer with the outline headlines
-   -skeleton-select is a bit thin, not yet finished?
-   add a preview mode, with its own keymap for faster editing and
    copying, like dired
-   enhance abbrev definitions for \*create, \*dowhile logics:
-   use the Ansys sample input listing for template-examples
-   additional dialog boxes with:
    /ui,anno,ksel&#x2026;,wpse,help,query,copy
-   make outline string in skeletons configurable
-   spider beams, \_bolt.mac, screw.mac, Mohr-Coulomb criterion
-   rework concept with respect to the Ansys menu structure sort
    skeletons in menu. Concept: 1.) Ansys Workflow 2.) specialised
    macro library
-   Make skeleton-header properly working (info "(autotype)")
-   Optimise templates: completing-read, read-from-minibuffer
-   abbrev \`d does not indent properly in another block level
-   Implement choice when completing \*IF commands (\*ELSEIF or \*ENDIF
    ?THEN?).
-   Warn when including skeleton in read only file.
-   skeleton for numbering ansys-skeleton-numbering-controls
    (skeleton-insert docu)
-   suggestions with auto-completion of
    kp,line,area,volu,node,elem,tabn,sval
-   negation, what negation? TODO:
-   skeleton for skipping code \*if,then \*else\*endif if selection:
    wrap around and indenting \*go/\*if label is not fontified at the
    command line (restriction of 7 characters with out the colon.)
    must \*go:label be unambiguous?


<a id="org878706c"></a>

## Miscellaneous

-   hash or signature file for packages
-   show content of matlib/ folder
-   add to -display-variables a prefix argument for showing the value
    of the variable around point, or center the variables window&#x2026;
-   customisation option for a the web browser of -browse-ansys-help
-   ideas for preview also of a/the macro directory?
-   put graphics dlls in windows package
-   LSDYN support, see lsdyna.el
-   **embedded calc:** include in hacking.mac
-   **Alignment:** alignment "section" is not clearly defined in function
    -align
-   **alignment:** extend to vector definitions
    t(1,0) = 20,300,3094,
    t(1,1) =  3,  4,   9,
-   Utility for clearing files like .rst, &#x2026; or using dired, clear<sub>files.sh</sub>?
    with listing listing of file types
-   Configure the highlighting colours with black on white background
-   C-j, M-j are not skipping to \`,' whith default command (from second
    line onwards)!
-   supply command for clearing recursively not important process files:
    .rst, .log, &#x2026;, supply a customisaton variable
-   narrow, outline, transparent-font: eblocks, nblocks by default?
-   add notes for parameter help of undocumented commands (alist)
-   create filter variable for hiding not installed license types
    ("aiiges" "aihexa") or better regexp filter "ai.\*\\\\|acf.\*"
-   commands shorter than 4 chars are not allowed with additional chars
    adjust this to -highlighting-level 0
-   Make Ansys-Mode also working solely with ansys-mode.el??
-   make M-C-h more intelligent like M-h (if mark&#x2026;)
-   speed concern: replace -find-duplicate-p with function argument to
    add-to-list
-   For non-comint-mode usage: display .log file with tail mode
-   is outline-mode enabled? no! make default?, outline
-   take care of setup procedure: v110/ansys/apdl/start110.ans
    /MPLIB,READ,/ansys<sub>inc</sub>/v110/ansys/matlib
-   removing/renaming/checking abort file?
-   Are characters behind unique commands shorter than 4 characters
    possible? No /sol(u) sufficient? Yes condensed input line ($)
    behind commands without arguments possible? Yes have a look in
    -variable-defining-commands!  Warn when - unintentionally -
    arguments are used for Ansys commands which do not allow
    arguments.  Or implement some auto-newline feature?  But
    problematic in condensed command lines or when applying code
    comments!
-   undocumented ask parameter
-   mode-line-format nil);no mode line for this buffer Unambiguous
-   Emacs: old-style backquotes?  used in the old template macro system
-   completion of function names: cursor should end within parentheses
-   better hints for auto-insertion features
-   up/down-block when we are over a begin-keyword and in a block-end
    line
-   component names are fontified as variables! separate them cmlist?
-   format string for \*VWRITE: line(s) below, in parens, when FORTRAN
    format specifiers are used, keyword SEQU povides row numbers, up
    to 19 parameters are allowed
-   remove vestiges of ansys-mod.el for making ansys-mode.el GPL
    proof.  Check whether octave-mod.el really is GPL compliant, use
    -ctave-mod.el from 1997, kill octave-mod.el afterwards in
    makefile read every symbol docu string ->NEW<sub>C</sub> or \_C or OCTAVE<sub>C</sub>
-   replace/extend column-ruler with ruler-mode or ruler implemented as
    overlay in buffer
-   make everything completely customisable, eg auto-insert stuff
    customisable enable, Emacs customisation of auto-insert-query
-   Fontify **completion list** distinguishing elements: commands,
    functions and keywords.
-   provide a list of options for the -license function, set this
    function in the defcustom lmstat -a etc.
-   auto-indent-switch as defcustom?
-   inhibit the unnecessary blink-matching-block display when closing a
    block behind a block-end keyword
-   highlight matching block keywords (similar to show-paren-mode) when
    point is at keyword
-   Implement highlighting of bracket pairs with the correct level in
    Ansys GET- and parametric- functions.
-   highlighting of plot commands inside the /GCMD command
-   DEFSUBSTs with DEFUNs inside aren't particularly helpful?
-   Emphasise better implied (colon) loops n,(1:6),(2:12:2) => n,1,2
    $ n,2,4 $&#x2026; (little used, I know, but any ideas going beyond the
    colon?).
-   startup screen for Ansys mode: Mode help, Ansys version,
    supressing the startup screen 'ansys-mode-startup-message maybe
    as advice when sluggish -> compiliation
-   Enable choice for /show,3d or x11 (-start-graphics)
-   Provide a way to send commands to the tcl-tk Ansys gui (x11
    programming).


<a id="org97472d9"></a>

## Ansys syntax restrictions not (yet) accounted for

-   Parentheses can only be nested 4 levels deep and only up to 9
    operations (+,-,\*,&#x2026;) within these set of parentheses
-   PATH name is restricted to 8 chars
-   \*SET parameter strings may only be 32 character long!
-   Character parameters are restricted to only 8 characters.
-   \*MSG command can only have 9 additional continuation lines
-   Code line restriction of 640 characters
-   Block level restriction of 20 levels of nested \*DO loops (except
    with /INPUT and \*USE)
-   Block level restriction of 10 levels of nested \*IF blocks
-   Macro level restriction: 20 macros


<a id="org8636548"></a>

## Unknown Ansys stuff

-   what the heck is the \*UILIST command?
-   Is hyper56 a valid element?

---

